health-app/app/Models/UserModel.php

    public function validateUser($email, $password)
    {
        $password = md5($password);
        $user = $this->where('email', $email)
                     ->where('password', $password)
                     ->first();
---
SELECT *
FROM `users`
WHERE `email` = 'farah@example.com'
AND `password` = '482c811da5d5b4bc6d497ffa98491e38'
 LIMIT 1

    public function getUser($id = false)
    {
        if ($id === false) {
            return $this->findAll();
---
SELECT *
FROM `users`