health-app/app/Controllers/OrderController.php

SELECT *
FROM `orders`
WHERE `orders`.`order_id` = '2'
---
    public function index()
    {
        $orders = $this->orderModel->getOrder();

SELECT *
FROM `orders`
WHERE `user_id` = '2'
---
    public function showByUser($userId)
    {
        $orders = $this->orderModel->getOrderByUser($userId);

SELECT *
FROM `order_details`
WHERE `order_id` = '2'
---
    public function showDetail($orderId)
    {
        // Ambil data order berdasarkan ID
        $order = $this->orderModel->getOrder($orderId);
        if (!$order) {
            return $this->response->setJSON(['message' => "Order with ID $orderId not found."]);
        }

        // Ambil detail pesanan terkait
        $orderDetails = $this->orderDetailModel->getOrderDetail($orderId);

SELECT *
FROM `orders`
WHERE `orders`.`order_id` = '12'
---
    public function update($id)
    {
        $data = $this->request->getJSON(true);
        $status = $data['status'] ?? null;
        if (!$status) {
            return $this->response->setJSON(['message' => 'Status is required.']);
        }
        if (!in_array($status, ['pending', 'paid', 'shipped', 'completed', 'cancelled'])) {
            return $this->response->setJSON(['message' => 'Invalid status.']);
        }

        $order = $this->orderModel->find($id);