app/Controllers/OrderController.php

        ];

        // Simpan data order ke tabel `orders`
        $this->orderModel->insert($orderData);
---
INSERT INTO `orders` (`user_id`, `total_price`, `status`, `shipping_address`) VALUES ('22', 0, 'pending', 'asdas')

            $price = $product['price'] * $quantity;

            // Simpan ke tabel `order_details`
            $this->orderDetailModel->insert([
                'order_id' => $orderId,
                'product_id' => $productId,
                'quantity' => $quantity,
                'price' => $price
            ]);

            // Kurangi stok produk
            $productModel->update($productId, [
                'stock' => $product['stock'] - $quantity
            ]);
        }

        // Perbarui total harga pesanan di tabel `orders`
        $this->orderModel->update($orderId, ['total_price' => $totalPrice]);
---
INSERT INTO `order_details` (`order_id`, `product_id`, `quantity`, `price`) VALUES (14, '8', '1', 12000)
UPDATE `products` SET `stock` = 399
WHERE `products`.`product_id` IN ('8')
UPDATE `orders` SET `total_price` = 12000
WHERE `orders`.`order_id` IN (14)