app/Controllers/PaymentController.php

SELECT *
FROM `payments`
---
    public function index()
    {
        $payments = $this->paymentModel->findAll();

SELECT *
FROM `orders`
WHERE `orders`.`order_id` = 11
---
    public function create()
    {
        // Ambil data JSON dari request
        $requestData = $this->request->getJSON(true);
        $orderId = $requestData['order_id'] ?? null;
        // Validasi input
        if (!$orderId) {
            return $this->response->setJSON(['message' => 'Invalid input. Please provide order_id.']);
        }

        // Ambil data order berdasarkan orderId
        $orderModel = new OrderModel();
        $order = $orderModel->find($orderId);