app/Controllers/Telemed_DoctorController.php

SELECT `jadwal_dokter`.`dokter_id`, `jadwal_dokter`.`jam`, `jadwal_dokter`.`jadwal_konsultasi` AS `tanggal`, `data_dokter`.`spesialis`, `data_dokter`.`nama_dokter`
FROM `jadwal_dokter`
JOIN `data_dokter` ON `jadwal_dokter`.`dokter_id` = `data_dokter`.`dokter_id`
WHERE `data_dokter`.`spesialis` LIKE '%%' ESCAPE '!'
---
    public function getDoctor()
    {
        // get send json
        $spesialis = $this->request->getVar('spesialis');
        $jadwalDokterModel = new Telemed_JadwalDokterModel();

        // Pecah string menjadi array jika ada beberapa nilai (dipisahkan koma)
        $spesialisList = explode('-', $spesialis);

        // Mulai query
        $jadwalDokterModel
            ->select('jadwal_dokter.dokter_id, jadwal_dokter.jam, jadwal_dokter.jadwal_konsultasi AS tanggal, data_dokter.spesialis, data_dokter.nama_dokter')
            ->join('data_dokter', 'jadwal_dokter.dokter_id = data_dokter.dokter_id');

        // Tambahkan kondisi LIKE untuk setiap string dalam array
        foreach ($spesialisList as $value) {
            $jadwalDokterModel->orLike('data_dokter.spesialis', trim($value));
        }

        // Ambil data
        $jadwalDokter = $jadwalDokterModel->findAll();