app/Controllers/Telemed_AuthController.php

INSERT INTO `users` (`username`, `password`, `role`) VALUES ('farahaulia', '54afa97407b6b1aac35e8550365cc7c8', 'patient')
---
    public function registerProcess() {

            // Memeriksa apakah data 'username' dan 'password' ada dalam request
            $username = $this->request->getPost('username');
            $password = md5($this->request->getPost('password')); // Menggunakan MD5 untuk hashing password
            $role = $this->request->getPost('role');
            if ($username && $password) {
                // Simpan pengguna dengan role 'pending'
                $this->userModel->save([
                    'username' => $username,
                    'password' => $password,
                    'role' => $role ?? 'patient'
                ]);