app/Controllers/Telemed_DataDokterController.php

SELECT *
FROM `data_dokter`
WHERE `id` = '24'
 LIMIT 1
UPDATE `data_dokter` SET `id` = '24', `nama_dokter` = 'Dr. Citra Lestar', `spesialis` = 'Spesialis Penyakit Dalam', `updated_at` = '2025-01-09 19:42:16'
WHERE `data_dokter`.`dokter_id` IN ('6')
---
    public function save()
    {
        $dokterModel = new Telemed_DataDokterModel();

        $userId = session()->get('id'); // Ambil ID user dari session
        if (!$userId) {
            return redirect()->back()->with('error', 'User ID tidak ditemukan di session.');
        }

        // Data yang akan disimpan atau diperbarui
        $data = [
            'id' => $userId,
            'nama_dokter' => $this->request->getPost('nama_dokter'),
            'spesialis' => $this->request->getPost('spesialis'),
        ];

        // Cek apakah data dokter sudah ada
        $existingDokter = $dokterModel->where('id', $userId)->first();

        if ($existingDokter) {
            // Jika data ada, update
            $dokterModel->update($existingDokter['dokter_id'], $data);