app/Controllers/Telemed_BookingController.php

    public function index()
    {
        $patientModel = new Telemed_DataPasienModel();
        $jadwalDokterModel = new Telemed_JadwalDokterModel();

        // Ambil ID user dari session
        $userId = session()->get('id');

        if (!$userId) {
            log_message('error', 'User ID tidak ditemukan di session.');
            return redirect()->to('/login')->with('error', 'Silakan login terlebih dahulu.');
        }

        // Daftar keluhan pasien berdasarkan ID pasien
        $keluhan = $patientModel->where('id', $userId)->findAll();

        // Daftar jadwal dokter, hanya kolom yang dibutuhkan
        $jadwalDokter = $jadwalDokterModel
            ->select('jadwal_dokter.dokter_id, jadwal_dokter.jam, jadwal_dokter.jadwal_konsultasi AS tanggal, data_dokter.spesialis, data_dokter.nama_dokter')
            ->join('data_dokter', 'jadwal_dokter.dokter_id = data_dokter.dokter_id')
            ->findAll();
---
SELECT *
FROM `data_pasien`
WHERE `id` = '3'
SELECT `jadwal_dokter`.`dokter_id`, `jadwal_dokter`.`jam`, `jadwal_dokter`.`jadwal_konsultasi` AS `tanggal`, `data_dokter`.`spesialis`, `data_dokter`.`nama_dokter`
FROM `jadwal_dokter`
JOIN `data_dokter` ON `jadwal_dokter`.`dokter_id` = `data_dokter`.`dokter_id`

    public function create()
    {
        $bookingModel = new Telemed_BookingModel();
        $jadwalDokterModel = new Telemed_JadwalDokterModel();

        // Ambil data dari form
        $patientId = session()->get('id');
        $jadwalDokterId = $this->request->getPost('jadwal_dokter_id');

        // Validasi input
        if (!$patientId || !$jadwalDokterId) {
            log_message('error', 'Validasi input gagal. Semua field wajib diisi.');
            return redirect()->back()->with('error', 'Semua field wajib diisi!')->withInput();
        }

        // Ambil detail jadwal dokter berdasarkan jadwal_dokter_id
        $jadwal = $jadwalDokterModel->find($jadwalDokterId);

        if (!$jadwal) {
            log_message('error', 'Jadwal dokter tidak ditemukan.');
            return redirect()->back()->with('error', 'Jadwal dokter tidak valid.')->withInput();
        }

        // Cek apakah pasien sudah pernah booking untuk jadwal dokter ini
        $existingBooking = $bookingModel
            ->where('patient_id', $patientId)
            ->where('dokter_id', $jadwal['dokter_id'])
            ->where('booking_date', $jadwal['jadwal_konsultasi'])
            ->where('jam_booking', $jadwal['jam'])
            ->first();
---
SELECT *
FROM `jadwal_dokter`
WHERE `jadwal_dokter`.`jadwal_dokter_id` = '2|2024-12-30|06:00:00'
SELECT *
FROM `bookings`
WHERE `patient_id` = '13'
AND `dokter_id` = '2'
AND `booking_date` = '2024-12-30'
AND `jam_booking` = '06:00:00'
 LIMIT 1

        ];

        try {
            $bookingModel->save($data);
---
INSERT INTO `bookings` (`patient_id`, `dokter_id`, `booking_date`, `jam_booking`) VALUES ('13', '2', '2024-12-30', '06:00:00')