app/Models/OrderModel.php

    public function updateOrderStatus($status, $id)
    {
        return $this->update($id, ['status' => $status]);
---
UPDATE `orders` SET `status` = 'completed'
WHERE `orders`.`order_id` IN ('12')