app/Models/ProductModel.php

SELECT *
FROM `products`
SELECT *
FROM `products`
WHERE `product_id` = '8'
---
    public function getProduct($id = false)
    {
        if ($id === false) {
            // Kembalikan semua data
            return $this->findAll();
        } else {
            // Ambil data berdasarkan ID dan kembalikan sebagai array
            $result = $this->getWhere(['product_id' => $id])->getRowArray();

SELECT `product_id`, `name`, `category`, `price`
FROM `products`
WHERE `is_active` = 1
---
    public function getProductByIsActive()
    {
        return $this->db->table('products')
            ->select('product_id, name, category, price')  // Gabungkan kolom dalam satu string
            ->where('is_active', 1)
            ->get()  // Menjalankan query
            ->getResultArray();  // Mengembalikan hasil sebagai array

SELECT *
FROM `products`
WHERE `name` LIKE '%C%' ESCAPE '!'
OR  `category` LIKE '%C%' ESCAPE '!'
---
    public function searchProduct($keyword)
    {
        return $this->like('name', $keyword)->orLike('category', $keyword)->get()->getResultArray();